pmo-dataset/variations/mermaid_basic/10.mmd
graph LR
	Task_9["Provide support for troubleshooting"] --> ExclusiveGateway_3{"X"}
	ParallelGateway_2{"+"} --> ExclusiveGateway_6{"X"}
	Task_4["Procure necessary tools or licenses"] --> Task_1["Install the solution"]
	ParallelGateway_4{"+"} --> ExclusiveGateway_5{"X"}
	ExclusiveGateway_4{"X"} --> ParallelGateway_4
	ParallelGateway_1{"+"} --> Task_2["Assess compatibility"]
	ParallelGateway_2 --> ExclusiveGateway_7{"X"}
	Task_6["Test solution"] --> Task_7["Roll out solution to requesting department"]
	ExclusiveGateway_2{"X"} --> Task_9
	ExclusiveGateway_1{"X"} --> ExclusiveGateway_5
	Task_2 --> ParallelGateway_3{"+"}
	Task_3["Evaluate cost and resource needs"] --> ParallelGateway_3
	ExclusiveGateway_1 --> Task_4
	ExclusiveGateway_3 --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_3 --> ExclusiveGateway_2
	ExclusiveGateway_7 --> Task_8["Provide training"]
	Task_5["Submit IT solution request"] --> ParallelGateway_1
	ParallelGateway_3 --> ExclusiveGateway_1
	ExclusiveGateway_5 --> EndEvent_1(("end"))
	StartEvent_1(("start")) --> Task_5
	Task_1 --> Task_6
	Task_7 --> ParallelGateway_2
	Task_8 --> ExclusiveGateway_4
	ExclusiveGateway_7 --> ExclusiveGateway_4
	ExclusiveGateway_6 --> ExclusiveGateway_2
	ExclusiveGateway_8 --> ParallelGateway_4
	ParallelGateway_1 --> Task_3
	ExclusiveGateway_6 --> ExclusiveGateway_8
